In [1]:
import numpy as np
import pandas as pd
import mysql.connector as sql

In [2]:
# Database args
db_user = 'root'
db_passwd = ''
db_host = 'localhost'
db_name = 'sensores'

In [3]:
cnx = sql.connect(user=db_user, password=db_passwd, host=db_host, database=db_name)

In [5]:
query= "SHOW TABLES;"
tablas=pd.read_sql(query, con=cnx)
tablas

  Tables_in_sensores
0            valores

In [9]:
query= "SELECT * from valores WHERE ubicacion='santiago';"
valores=pd.read_sql(query, con=cnx)
valores

   id  valor tiempo  humedad ubicacion
0   1     20   None       40  santiago
1   2     20   None       40  santiago
2   3     22   None       40  santiago
3   4     22   None       40  santiago
4  11     20   None       40  santiago
5  12     22   None       40  santiago